### 5장 실습 1

In [15]:
import numpy as np
import pandas as pd

names_1=['Hisila', 'Brian','Zeppy']
salary_1=[23,30,21]

names_2=['Ram','Shyam',"Hari"]
salary_2=[22,23,31]

df_1 = pd.DataFrame({'Name': names_1, 'Salary': salary_1})
df_2 = pd.DataFrame({'Name': names_2, 'Salary': salary_2})

In [16]:
df_1

     Name  Salary
0  Hisila      23
1   Brian      30
2   Zeppy      21

In [17]:
df_2

    Name  Salary
0    Ram      22
1  Shyam      23
2   Hari      31

In [18]:
merged_df = df_1.append(df_2)   # merged_df = df_1.append(df_2,ignore_index=True)
merged_df

C:\Users\PARKSEUNGHEUN\AppData\Local\Temp\ipykernel_17036\2130263368.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  merged_df = df_1.append(df_2)   # merged_df = df_1.append(df_2,ignore_index=True)

     Name  Salary
0  Hisila      23
1   Brian      30
2   Zeppy      21
0     Ram      22
1   Shyam      23
2    Hari      31

In [19]:
merged_df.drop([1])

     Name  Salary
0  Hisila      23
2   Zeppy      21
0     Ram      22
2    Hari      31

In [20]:
merged_df.drop(['Name'], axis=1) # Column을 없애고 싶은 경우 axis=1

   Salary
0      23
1      30
2      21
0      22
1      23
2      31

In [21]:
df = pd.DataFrame({'A':[7,1,5,4,2,1,4,4,8],'B':[1,2,8,5,3,4,2,6,8]})
df['A'].unique()

array([7, 1, 5, 4, 2, 8], dtype=int64)

In [48]:
import numpy as np
import pandas as pd

fruits = pd.DataFrame({'name':['apple','mango','banana','cherry'],

                    'price':[2000,150,500,400],

                    'qty':[5,4,10, np.NaN]})

In [49]:
fruits

     name  price   qty
0   apple   2000   5.0
1   mango    150   4.0
2  banana    500  10.0
3  cherry    400   NaN

In [50]:
fruits.dtypes

name      object
price      int64
qty      float64
dtype: object

In [51]:
fruits.index = fruits['name']
fruits

          name  price   qty
name
apple    apple   2000   5.0
mango    mango    150   4.0
banana  banana    500  10.0
cherry  cherry    400   NaN

In [52]:
fruits.iloc[:,1:3]

        price   qty
name
apple    2000   5.0
mango     150   4.0
banana    500  10.0
cherry    400   NaN

In [53]:
fruits = fruits.iloc[:,1:3]
fruits

        price   qty
name
apple    2000   5.0
mango     150   4.0
banana    500  10.0
cherry    400   NaN

### 1) qty의 평균

In [54]:
fruits['qty'].mean()
# fruits['qty']

6.333333333333333

### 2) price가 1000 이상인 과일 이름 출력

In [55]:
fruits[fruits['price']>=1000]

       price  qty
name
apple   2000  5.0

### 3) cherry, banana, mango, apple 순 출력

In [56]:
fruits.reindex(['cherry', 'banana', 'mango', 'apple']) # reindex로 새로운 친구 추가도 가능

        price   qty
name
cherry    400   NaN
banana    500  10.0
mango     150   4.0
apple    2000   5.0

### 4) row에 추가 peach 추가 (price : 2500, qty : 3)

In [68]:
fruits = fruits.reindex(['cherry', 'banana', 'mango', 'apple', 'peach'])
fruits.iloc[4,0]= 2500.0
fruits.iloc[4,1] = 3.0
fruits

         price   qty
name
cherry   400.0   NaN
banana   500.0  10.0
mango    150.0   4.0
apple   2000.0   5.0
peach   2500.0   3.0

### 5) qty -> QTY 수정

In [70]:
col_list=list(fruits.columns) # 기존 fruits의 column 정보 불러와서 저장
col_list[1] = 'QTY'# 그 중에서 'qty'를 'QTY'로 변경
fruits.columns = col_list # col_list 적용
fruits

         price   QTY
name
cherry   400.0   NaN
banana   500.0  10.0
mango    150.0   4.0
apple   2000.0   5.0
peach   2500.0   3.0